results/validation_final/benchmark_wan/qps_0.5/client.log
INFO 09-05 12:15:37 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x742819031da0>, seed=0, num_prompts=20, dataset_name='custom', no_stream=False, dataset_path='/root/A-weekender-s-challenge-for-AI-Infra/results/validation_final/benchmark_wan/workload.jsonl', no_oversample=False, custom_output_len=256, custom_skip_chat_template=True, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, endpoint_type='openai', label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', max_concurrency=None, model='/root/A-weekender-s-challenge-for-AI-Infra/models/qwen', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=0.5, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/root/A-weekender-s-challenge-for-AI-Infra/results/validation_final/benchmark_wan/qps_0.5', result_filename='benchmark.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=['ttft:3000', 'tpot:100'], request_id_prefix='qps-0.5-1788581733746466647-', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen/Qwen2.5-3B-Instruct', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:09 elapsed, 1415:51:03 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 0.5
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 20/20 [00:49<00:00,  2.47s/it]
============ Serving Benchmark Result ============
Successful requests:                     20        
Request rate configured (RPS):           0.50      
Benchmark duration (s):                  49.47     
Total input tokens:                      81920     
Total generated tokens:                  5120      
Request throughput (req/s):              0.40      
Request goodput (req/s):                 0.38      
Output token throughput (tok/s):         103.50    
Total Token throughput (tok/s):          1759.57   
---------------Time to First Token----------------
Mean TTFT (ms):                          1237.48   
Median TTFT (ms):                        779.76    
P50 TTFT (ms):                           779.76    
P95 TTFT (ms):                           2660.04   
P99 TTFT (ms):                           4225.02   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          49.38     
Median TPOT (ms):                        50.17     
P50 TPOT (ms):                           50.17     
P95 TPOT (ms):                           56.03     
P99 TPOT (ms):                           56.51     
---------------Inter-token Latency----------------
Mean ITL (ms):                           49.38     
Median ITL (ms):                         34.69     
P50 ITL (ms):                            34.69     
P95 ITL (ms):                            43.48     
P99 ITL (ms):                            784.11    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13829.59  
Median E2EL (ms):                        14116.21  
P50 E2EL (ms):                           14116.21  
P95 E2EL (ms):                           15356.34  
P99 E2EL (ms):                           15683.03  
==================================================